[net]
height=36
width=36
channels=3
downscale=1

[convolutional]
filters=8
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[convolutional]
filters=8
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[max]
size=2
stride=2

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[convolutional]
filters=16
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[max]
size=2
stride=2

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[convolutional]
filters=32
size=3
stride=1
pad=1
activation=linear
hasBias=1

[batchnorm]
activation = relu

[avg]
size=9
stride=9

[fc]
filters=54
hasBias=1

[softmax]




